<details>
<summary>Execution result of "run plan --all" in "."</summary>

```terraform
23:23:18.383 INFO   The stack at . will be processed in the following order for command plan:
Group 1
- Module ./management-account/eu-west-1/s3
- Module ./management-account/global-infra/organization-accounts
- Module ./playground-account/eu-west-1/s3
- Module ./test-account/eu-west-1/s3


23:23:18.606 INFO   [playground-account/eu-west-1/s3] Downloading Terraform configurations from ./modules/s3 into ./playground-account/eu-west-1/s3/.terragrunt-cache/Ife-siSQSkZudNuf1ioRzK__ydI/p0hmT_yU9GfVIbcsvydhmNhIJWg
23:23:18.670 INFO   [test-account/eu-west-1/s3] Downloading Terraform configurations from ./modules/s3 into ./test-account/eu-west-1/s3/.terragrunt-cache/FIgbXJVdUJAkmsa6YIf24Zbjalw/p0hmT_yU9GfVIbcsvydhmNhIJWg
23:23:18.699 INFO   [management-account/eu-west-1/s3] Downloading Terraform configurations from ./modules/s3 into ./management-account/eu-west-1/s3/.terragrunt-cache/6O7bSTWfYv7WPnJvTEak2cevHGQ/p0hmT_yU9GfVIbcsvydhmNhIJWg
23:23:18.700 INFO   [management-account/global-infra/organization-accounts] Downloading Terraform configurations from ./modules/organization-account into ./management-account/global-infra/organization-accounts/.terragrunt-cache/3XLPvzLN2Hf8668drqHKYhDUbDk/Yycl6dC0BtLQ-XFNjTw2ySiFaUQ
23:23:19.238 INFO   [management-account/global-infra/organization-accounts] terraform: Initializing the backend...
23:23:19.267 INFO   [playground-account/eu-west-1/s3] terraform: Initializing the backend...
23:23:19.268 INFO   [test-account/eu-west-1/s3] terraform: Initializing the backend...
23:23:19.269 INFO   [management-account/eu-west-1/s3] terraform: Initializing the backend...
23:23:20.278 INFO   [management-account/global-infra/organization-accounts] terraform: 
23:23:20.278 INFO   [management-account/global-infra/organization-accounts] terraform: Successfully configured the backend "s3"! Terraform will automatically
23:23:20.278 INFO   [management-account/global-infra/organization-accounts] terraform: use this backend unless the backend configuration changes.
23:23:20.285 INFO   [playground-account/eu-west-1/s3] terraform: 
23:23:20.285 INFO   [playground-account/eu-west-1/s3] terraform: Successfully configured the backend "s3"! Terraform will automatically
23:23:20.285 INFO   [playground-account/eu-west-1/s3] terraform: use this backend unless the backend configuration changes.
23:23:20.291 INFO   [test-account/eu-west-1/s3] terraform: 
23:23:20.291 INFO   [test-account/eu-west-1/s3] terraform: Successfully configured the backend "s3"! Terraform will automatically
23:23:20.291 INFO   [test-account/eu-west-1/s3] terraform: use this backend unless the backend configuration changes.
23:23:20.296 INFO   [management-account/eu-west-1/s3] terraform: 
23:23:20.296 INFO   [management-account/eu-west-1/s3] terraform: Successfully configured the backend "s3"! Terraform will automatically
23:23:20.296 INFO   [management-account/eu-west-1/s3] terraform: use this backend unless the backend configuration changes.
23:23:20.656 INFO   [test-account/eu-west-1/s3] terraform: Initializing provider plugins...
23:23:20.656 INFO   [test-account/eu-west-1/s3] terraform: - Finding latest version of hashicorp/aws...
23:23:20.662 INFO   [management-account/eu-west-1/s3] terraform: Initializing provider plugins...
23:23:20.662 INFO   [management-account/eu-west-1/s3] terraform: - Finding latest version of hashicorp/aws...
23:23:20.664 INFO   [playground-account/eu-west-1/s3] terraform: Initializing provider plugins...
23:23:20.664 INFO   [playground-account/eu-west-1/s3] terraform: - Finding latest version of hashicorp/aws...
23:23:20.674 INFO   [management-account/global-infra/organization-accounts] terraform: Initializing provider plugins...
23:23:20.674 INFO   [management-account/global-infra/organization-accounts] terraform: - Finding latest version of hashicorp/aws...
23:23:21.010 INFO   [test-account/eu-west-1/s3] terraform: - Installing hashicorp/aws v6.0.0...
23:23:21.040 INFO   [management-account/global-infra/organization-accounts] terraform: - Installing hashicorp/aws v6.0.0...
23:23:21.096 INFO   [playground-account/eu-west-1/s3] terraform: - Installing hashicorp/aws v6.0.0...
23:23:21.119 INFO   [management-account/eu-west-1/s3] terraform: - Installing hashicorp/aws v6.0.0...
23:23:27.327 INFO   [test-account/eu-west-1/s3] terraform: - Installed hashicorp/aws v6.0.0 (signed by HashiCorp)
23:23:27.327 INFO   [test-account/eu-west-1/s3] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
23:23:27.328 INFO   [test-account/eu-west-1/s3] terraform: selections it made above. Include this file in your version control repository
23:23:27.329 INFO   [test-account/eu-west-1/s3] terraform: so that Terraform can guarantee to make the same selections by default when
23:23:27.329 INFO   [test-account/eu-west-1/s3] terraform: you run "terraform init" in the future.
23:23:27.330 INFO   [test-account/eu-west-1/s3] terraform: Terraform has been successfully initialized!
23:23:27.379 INFO   [management-account/eu-west-1/s3] terraform: - Installed hashicorp/aws v6.0.0 (signed by HashiCorp)
23:23:27.379 INFO   [management-account/eu-west-1/s3] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
23:23:27.379 INFO   [management-account/eu-west-1/s3] terraform: selections it made above. Include this file in your version control repository
23:23:27.379 INFO   [management-account/eu-west-1/s3] terraform: so that Terraform can guarantee to make the same selections by default when
23:23:27.379 INFO   [management-account/eu-west-1/s3] terraform: you run "terraform init" in the future.
23:23:27.400 INFO   [management-account/eu-west-1/s3] terraform: Terraform has been successfully initialized!
23:23:27.424 INFO   [playground-account/eu-west-1/s3] terraform: - Installed hashicorp/aws v6.0.0 (signed by HashiCorp)
23:23:27.424 INFO   [playground-account/eu-west-1/s3] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
23:23:27.424 INFO   [playground-account/eu-west-1/s3] terraform: selections it made above. Include this file in your version control repository
23:23:27.424 INFO   [playground-account/eu-west-1/s3] terraform: so that Terraform can guarantee to make the same selections by default when
23:23:27.424 INFO   [playground-account/eu-west-1/s3] terraform: you run "terraform init" in the future.
23:23:27.424 INFO   [playground-account/eu-west-1/s3] terraform: Terraform has been successfully initialized!
23:23:27.465 INFO   [management-account/global-infra/organization-accounts] terraform: - Installed hashicorp/aws v6.0.0 (signed by HashiCorp)
23:23:27.466 INFO   [management-account/global-infra/organization-accounts] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
23:23:27.466 INFO   [management-account/global-infra/organization-accounts] terraform: selections it made above. Include this file in your version control repository
23:23:27.466 INFO   [management-account/global-infra/organization-accounts] terraform: so that Terraform can guarantee to make the same selections by default when
23:23:27.466 INFO   [management-account/global-infra/organization-accounts] terraform: you run "terraform init" in the future.
23:23:27.466 INFO   [management-account/global-infra/organization-accounts] terraform: Terraform has been successfully initialized!
23:23:29.310 STDERR [test-account/eu-west-1/s3] terraform: ╷
23:23:29.310 STDERR [test-account/eu-west-1/s3] terraform: │ Error: Variables not allowed
23:23:29.310 STDERR [test-account/eu-west-1/s3] terraform: │ 
23:23:29.310 STDERR [test-account/eu-west-1/s3] terraform: │   on <value for var.bucket_name> line 1:
23:23:29.310 STDERR [test-account/eu-west-1/s3] terraform: │   (source code not available)
23:23:29.310 STDERR [test-account/eu-west-1/s3] terraform: │ 
23:23:29.310 STDERR [test-account/eu-west-1/s3] terraform: │ Variables may not be used here.
23:23:29.310 STDERR [test-account/eu-west-1/s3] terraform: ╵
23:23:29.310 STDERR [test-account/eu-west-1/s3] terraform: ╷
23:23:29.310 STDERR [test-account/eu-west-1/s3] terraform: │ Error: No value for required variable
23:23:29.310 STDERR [test-account/eu-west-1/s3] terraform: │ 
23:23:29.310 STDERR [test-account/eu-west-1/s3] terraform: │   on variables.tf line 1:
23:23:29.310 STDERR [test-account/eu-west-1/s3] terraform: │    1: variable "bucket_name" {
23:23:29.310 STDERR [test-account/eu-west-1/s3] terraform: │ 
23:23:29.311 STDERR [test-account/eu-west-1/s3] terraform: │ The root module input variable "bucket_name" is not set, and has no default
23:23:29.311 STDERR [test-account/eu-west-1/s3] terraform: │ value. Use a -var or -var-file command line argument to provide a value for
23:23:29.311 STDERR [test-account/eu-west-1/s3] terraform: │ this variable.
23:23:29.311 STDERR [test-account/eu-west-1/s3] terraform: ╵
23:23:29.315 ERROR  [test-account/eu-west-1/s3] terraform invocation failed in ./test-account/eu-west-1/s3/.terragrunt-cache/FIgbXJVdUJAkmsa6YIf24Zbjalw/p0hmT_yU9GfVIbcsvydhmNhIJWg
23:23:29.316 ERROR  [test-account/eu-west-1/s3] Module ./test-account/eu-west-1/s3 has finished with an error
23:23:29.361 STDERR [management-account/eu-west-1/s3] terraform: ╷
23:23:29.362 STDERR [management-account/eu-west-1/s3] terraform: │ Error: Variables not allowed
23:23:29.362 STDERR [management-account/eu-west-1/s3] terraform: │ 
23:23:29.362 STDERR [management-account/eu-west-1/s3] terraform: │   on <value for var.bucket_name> line 1:
23:23:29.362 STDERR [management-account/eu-west-1/s3] terraform: │   (source code not available)
23:23:29.362 STDERR [management-account/eu-west-1/s3] terraform: │ 
23:23:29.362 STDERR [management-account/eu-west-1/s3] terraform: │ Variables may not be used here.
23:23:29.362 STDERR [management-account/eu-west-1/s3] terraform: ╵
23:23:29.362 STDERR [management-account/eu-west-1/s3] terraform: ╷
23:23:29.362 STDERR [management-account/eu-west-1/s3] terraform: │ Error: No value for required variable
23:23:29.362 STDERR [management-account/eu-west-1/s3] terraform: │ 
23:23:29.362 STDERR [management-account/eu-west-1/s3] terraform: │   on variables.tf line 1:
23:23:29.362 STDERR [management-account/eu-west-1/s3] terraform: │    1: variable "bucket_name" {
23:23:29.362 STDERR [management-account/eu-west-1/s3] terraform: │ 
23:23:29.362 STDERR [management-account/eu-west-1/s3] terraform: │ The root module input variable "bucket_name" is not set, and has no default
23:23:29.362 STDERR [management-account/eu-west-1/s3] terraform: │ value. Use a -var or -var-file command line argument to provide a value for
23:23:29.362 STDERR [management-account/eu-west-1/s3] terraform: │ this variable.
23:23:29.363 STDERR [management-account/eu-west-1/s3] terraform: ╵
23:23:29.368 ERROR  [management-account/eu-west-1/s3] terraform invocation failed in ./management-account/eu-west-1/s3/.terragrunt-cache/6O7bSTWfYv7WPnJvTEak2cevHGQ/p0hmT_yU9GfVIbcsvydhmNhIJWg
23:23:29.368 ERROR  [management-account/eu-west-1/s3] Module ./management-account/eu-west-1/s3 has finished with an error
23:23:31.983 STDOUT [management-account/global-infra/organization-accounts] terraform: aws_organizations_account.this: Refreshing state... [id=929864627295]
23:23:32.390 STDOUT [playground-account/eu-west-1/s3] terraform: aws_s3_bucket.this: Refreshing state... [id=ma-test-bucket-terragrunt]
23:23:32.689 STDOUT [management-account/global-infra/organization-accounts] terraform: No changes. Your infrastructure matches the configuration.
23:23:32.689 STDOUT [management-account/global-infra/organization-accounts] terraform: Terraform has compared your real infrastructure against your configuration
23:23:32.689 STDOUT [management-account/global-infra/organization-accounts] terraform: and found no differences, so no changes are needed.
23:23:34.532 STDERR [playground-account/eu-west-1/s3] terraform: ╷
23:23:34.532 STDOUT [playground-account/eu-west-1/s3] terraform: Terraform used the selected providers to generate the following execution
23:23:34.532 STDOUT [playground-account/eu-west-1/s3] terraform: plan. Resource actions are indicated with the following symbols:
23:23:34.532 STDERR [playground-account/eu-west-1/s3] terraform: │ Error: Unsupported attribute
23:23:34.532 STDOUT [playground-account/eu-west-1/s3] terraform:   + create
23:23:34.532 STDERR [playground-account/eu-west-1/s3] terraform: │ 
23:23:34.532 STDOUT [playground-account/eu-west-1/s3] terraform:   - destroy
23:23:34.532 STDERR [playground-account/eu-west-1/s3] terraform: │   on outputs.tf line 4, in output "bucket_id":
23:23:34.532 STDOUT [playground-account/eu-west-1/s3] terraform: Terraform planned the following actions, but then encountered a problem:
23:23:34.532 STDERR [playground-account/eu-west-1/s3] terraform: │    4:         for k, v in aws_s3_bucket.this : k => k.id
23:23:34.532 STDOUT [playground-account/eu-west-1/s3] terraform:   # aws_s3_bucket.this will be destroyed
23:23:34.532 STDERR [playground-account/eu-west-1/s3] terraform: │ 
23:23:34.532 STDOUT [playground-account/eu-west-1/s3] terraform:   # (because resource uses count or for_each)
23:23:34.532 STDOUT [playground-account/eu-west-1/s3] terraform:   - resource "aws_s3_bucket" "this" {
23:23:34.532 STDERR [playground-account/eu-west-1/s3] terraform: │ Can't access attributes on a primitive-typed value (string).
23:23:34.532 STDERR [playground-account/eu-west-1/s3] terraform: ╵
23:23:34.532 STDOUT [playground-account/eu-west-1/s3] terraform:       - arn                         = "arn:aws:s3:::ma-test-bucket-terragrunt" -> null
23:23:34.532 STDOUT [playground-account/eu-west-1/s3] terraform:       - bucket                      = "ma-test-bucket-terragrunt" -> null
23:23:34.532 STDOUT [playground-account/eu-west-1/s3] terraform:       - bucket_domain_name          = "ma-test-bucket-terragrunt.s3.amazonaws.com" -> null
23:23:34.532 STDOUT [playground-account/eu-west-1/s3] terraform:       - bucket_region               = "eu-west-1" -> null
23:23:34.532 STDOUT [playground-account/eu-west-1/s3] terraform:       - bucket_regional_domain_name = "ma-test-bucket-terragrunt.s3.eu-west-1.amazonaws.com" -> null
23:23:34.532 STDOUT [playground-account/eu-west-1/s3] terraform:       - force_destroy               = false -> null
23:23:34.532 STDOUT [playground-account/eu-west-1/s3] terraform:       - hosted_zone_id              = "Z1BKCTXD74EZPE" -> null
23:23:34.532 STDOUT [playground-account/eu-west-1/s3] terraform:       - id                          = "ma-test-bucket-terragrunt" -> null
23:23:34.532 STDOUT [playground-account/eu-west-1/s3] terraform:       - object_lock_enabled         = false -> null
23:23:34.532 STDOUT [playground-account/eu-west-1/s3] terraform:       - region                      = "eu-west-1" -> null
23:23:34.532 STDOUT [playground-account/eu-west-1/s3] terraform:       - request_payer               = "BucketOwner" -> null
23:23:34.533 STDOUT [playground-account/eu-west-1/s3] terraform:       - tags                        = {
23:23:34.533 STDOUT [playground-account/eu-west-1/s3] terraform:           - "Environment" = "test-env"
23:23:34.533 STDOUT [playground-account/eu-west-1/s3] terraform:           - "Name"        = "ma-test-bucket-tag"
23:23:34.533 STDOUT [playground-account/eu-west-1/s3] terraform:         } -> null
23:23:34.533 STDOUT [playground-account/eu-west-1/s3] terraform:       - tags_all                    = {
23:23:34.533 STDOUT [playground-account/eu-west-1/s3] terraform:           - "Environment" = "test-env"
23:23:34.533 STDOUT [playground-account/eu-west-1/s3] terraform:           - "Name"        = "ma-test-bucket-tag"
23:23:34.533 STDOUT [playground-account/eu-west-1/s3] terraform:         } -> null
23:23:34.533 STDOUT [playground-account/eu-west-1/s3] terraform:         # (3 unchanged attributes hidden)
23:23:34.533 STDOUT [playground-account/eu-west-1/s3] terraform:       - grant {
23:23:34.533 STDOUT [playground-account/eu-west-1/s3] terraform:           - id          = "930454f06437e7fdb90b65c7ecea90969c129dcffb5f63020b02e1295aa3c04d" -> null
23:23:34.533 STDOUT [playground-account/eu-west-1/s3] terraform:           - permissions = [
23:23:34.533 STDOUT [playground-account/eu-west-1/s3] terraform:               - "FULL_CONTROL",
23:23:34.533 STDOUT [playground-account/eu-west-1/s3] terraform:             ] -> null
23:23:34.533 STDOUT [playground-account/eu-west-1/s3] terraform:           - type        = "CanonicalUser" -> null
23:23:34.533 STDOUT [playground-account/eu-west-1/s3] terraform:             # (1 unchanged attribute hidden)
23:23:34.533 STDOUT [playground-account/eu-west-1/s3] terraform:         }
23:23:34.533 STDOUT [playground-account/eu-west-1/s3] terraform:       - server_side_encryption_configuration {
23:23:34.533 STDOUT [playground-account/eu-west-1/s3] terraform:           - rule {
23:23:34.533 STDOUT [playground-account/eu-west-1/s3] terraform:               - bucket_key_enabled = false -> null
23:23:34.533 STDOUT [playground-account/eu-west-1/s3] terraform:               - apply_server_side_encryption_by_default {
23:23:34.533 STDOUT [playground-account/eu-west-1/s3] terraform:                   - sse_algorithm     = "AES256" -> null
23:23:34.533 STDOUT [playground-account/eu-west-1/s3] terraform:                     # (1 unchanged attribute hidden)
23:23:34.533 STDOUT [playground-account/eu-west-1/s3] terraform:                 }
23:23:34.533 STDOUT [playground-account/eu-west-1/s3] terraform:             }
23:23:34.533 STDOUT [playground-account/eu-west-1/s3] terraform:         }
23:23:34.533 STDOUT [playground-account/eu-west-1/s3] terraform:       - versioning {
23:23:34.533 STDOUT [playground-account/eu-west-1/s3] terraform:           - enabled    = false -> null
23:23:34.533 STDOUT [playground-account/eu-west-1/s3] terraform:           - mfa_delete = false -> null
23:23:34.533 STDOUT [playground-account/eu-west-1/s3] terraform:         }
23:23:34.533 STDOUT [playground-account/eu-west-1/s3] terraform:     }
23:23:34.533 STDOUT [playground-account/eu-west-1/s3] terraform:   # aws_s3_bucket.this["ma-bucket-one-altamash"] will be created
23:23:34.534 STDOUT [playground-account/eu-west-1/s3] terraform:   + resource "aws_s3_bucket" "this" {
23:23:34.534 STDOUT [playground-account/eu-west-1/s3] terraform:       + acceleration_status         = (known after apply)
23:23:34.534 STDOUT [playground-account/eu-west-1/s3] terraform:       + acl                         = (known after apply)
23:23:34.534 STDOUT [playground-account/eu-west-1/s3] terraform:       + arn                         = (known after apply)
23:23:34.534 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket                      = "ma-bucket-one-altamash"
23:23:34.534 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_domain_name          = (known after apply)
23:23:34.534 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_prefix               = (known after apply)
23:23:34.534 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_region               = (known after apply)
23:23:34.534 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_regional_domain_name = (known after apply)
23:23:34.534 STDOUT [playground-account/eu-west-1/s3] terraform:       + force_destroy               = false
23:23:34.534 STDOUT [playground-account/eu-west-1/s3] terraform:       + hosted_zone_id              = (known after apply)
23:23:34.534 STDOUT [playground-account/eu-west-1/s3] terraform:       + id                          = (known after apply)
23:23:34.534 STDOUT [playground-account/eu-west-1/s3] terraform:       + object_lock_enabled         = (known after apply)
23:23:34.534 STDOUT [playground-account/eu-west-1/s3] terraform:       + policy                      = (known after apply)
23:23:34.534 STDOUT [playground-account/eu-west-1/s3] terraform:       + region                      = "eu-west-1"
23:23:34.534 STDOUT [playground-account/eu-west-1/s3] terraform:       + request_payer               = (known after apply)
23:23:34.534 STDOUT [playground-account/eu-west-1/s3] terraform:       + tags                        = {
23:23:34.534 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Environment" = "test-env"
23:23:34.534 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Name"        = "ma-test-bucket-tag"
23:23:34.534 STDOUT [playground-account/eu-west-1/s3] terraform:         }
23:23:34.534 STDOUT [playground-account/eu-west-1/s3] terraform:       + tags_all                    = {
23:23:34.534 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Environment" = "test-env"
23:23:34.534 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Name"        = "ma-test-bucket-tag"
23:23:34.534 STDOUT [playground-account/eu-west-1/s3] terraform:         }
23:23:34.534 STDOUT [playground-account/eu-west-1/s3] terraform:       + website_domain              = (known after apply)
23:23:34.534 STDOUT [playground-account/eu-west-1/s3] terraform:       + website_endpoint            = (known after apply)
23:23:34.535 STDOUT [playground-account/eu-west-1/s3] terraform:       + cors_rule (known after apply)
23:23:34.535 STDOUT [playground-account/eu-west-1/s3] terraform:       + grant (known after apply)
23:23:34.535 STDOUT [playground-account/eu-west-1/s3] terraform:       + lifecycle_rule (known after apply)
23:23:34.535 STDOUT [playground-account/eu-west-1/s3] terraform:       + logging (known after apply)
23:23:34.535 STDOUT [playground-account/eu-west-1/s3] terraform:       + object_lock_configuration (known after apply)
23:23:34.535 STDOUT [playground-account/eu-west-1/s3] terraform:       + replication_configuration (known after apply)
23:23:34.535 STDOUT [playground-account/eu-west-1/s3] terraform:       + server_side_encryption_configuration (known after apply)
23:23:34.535 STDOUT [playground-account/eu-west-1/s3] terraform:       + versioning (known after apply)
23:23:34.535 STDOUT [playground-account/eu-west-1/s3] terraform:       + website (known after apply)
23:23:34.535 STDOUT [playground-account/eu-west-1/s3] terraform:     }
23:23:34.535 STDOUT [playground-account/eu-west-1/s3] terraform:   # aws_s3_bucket.this["ma-bucket-two-altamash"] will be created
23:23:34.535 STDOUT [playground-account/eu-west-1/s3] terraform:   + resource "aws_s3_bucket" "this" {
23:23:34.535 STDOUT [playground-account/eu-west-1/s3] terraform:       + acceleration_status         = (known after apply)
23:23:34.535 STDOUT [playground-account/eu-west-1/s3] terraform:       + acl                         = (known after apply)
23:23:34.535 STDOUT [playground-account/eu-west-1/s3] terraform:       + arn                         = (known after apply)
23:23:34.535 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket                      = "ma-bucket-two-altamash"
23:23:34.535 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_domain_name          = (known after apply)
23:23:34.535 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_prefix               = (known after apply)
23:23:34.535 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_region               = (known after apply)
23:23:34.535 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_regional_domain_name = (known after apply)
23:23:34.535 STDOUT [playground-account/eu-west-1/s3] terraform:       + force_destroy               = false
23:23:34.535 STDOUT [playground-account/eu-west-1/s3] terraform:       + hosted_zone_id              = (known after apply)
23:23:34.535 STDOUT [playground-account/eu-west-1/s3] terraform:       + id                          = (known after apply)
23:23:34.535 STDOUT [playground-account/eu-west-1/s3] terraform:       + object_lock_enabled         = (known after apply)
23:23:34.535 STDOUT [playground-account/eu-west-1/s3] terraform:       + policy                      = (known after apply)
23:23:34.535 STDOUT [playground-account/eu-west-1/s3] terraform:       + region                      = "eu-west-1"
23:23:34.535 STDOUT [playground-account/eu-west-1/s3] terraform:       + request_payer               = (known after apply)
23:23:34.536 STDOUT [playground-account/eu-west-1/s3] terraform:       + tags                        = {
23:23:34.536 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Environment" = "test-env"
23:23:34.536 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Name"        = "ma-test-bucket-tag"
23:23:34.536 STDOUT [playground-account/eu-west-1/s3] terraform:         }
23:23:34.536 STDOUT [playground-account/eu-west-1/s3] terraform:       + tags_all                    = {
23:23:34.536 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Environment" = "test-env"
23:23:34.536 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Name"        = "ma-test-bucket-tag"
23:23:34.536 STDOUT [playground-account/eu-west-1/s3] terraform:         }
23:23:34.536 STDOUT [playground-account/eu-west-1/s3] terraform:       + website_domain              = (known after apply)
23:23:34.536 STDOUT [playground-account/eu-west-1/s3] terraform:       + website_endpoint            = (known after apply)
23:23:34.536 STDOUT [playground-account/eu-west-1/s3] terraform:       + cors_rule (known after apply)
23:23:34.536 STDOUT [playground-account/eu-west-1/s3] terraform:       + grant (known after apply)
23:23:34.536 STDOUT [playground-account/eu-west-1/s3] terraform:       + lifecycle_rule (known after apply)
23:23:34.536 STDOUT [playground-account/eu-west-1/s3] terraform:       + logging (known after apply)
23:23:34.536 STDOUT [playground-account/eu-west-1/s3] terraform:       + object_lock_configuration (known after apply)
23:23:34.536 STDOUT [playground-account/eu-west-1/s3] terraform:       + replication_configuration (known after apply)
23:23:34.536 STDOUT [playground-account/eu-west-1/s3] terraform:       + server_side_encryption_configuration (known after apply)
23:23:34.536 STDOUT [playground-account/eu-west-1/s3] terraform:       + versioning (known after apply)
23:23:34.536 STDOUT [playground-account/eu-west-1/s3] terraform:       + website (known after apply)
23:23:34.536 STDOUT [playground-account/eu-west-1/s3] terraform:     }
23:23:34.536 STDOUT [playground-account/eu-west-1/s3] terraform: Plan: 2 to add, 0 to change, 1 to destroy.
23:23:34.536 STDOUT [playground-account/eu-west-1/s3] terraform: 
23:23:34.545 ERROR  [playground-account/eu-west-1/s3] terraform invocation failed in ./playground-account/eu-west-1/s3/.terragrunt-cache/Ife-siSQSkZudNuf1ioRzK__ydI/p0hmT_yU9GfVIbcsvydhmNhIJWg
23:23:34.545 ERROR  [playground-account/eu-west-1/s3] Module ./playground-account/eu-west-1/s3 has finished with an error
23:23:34.546 ERROR  Run failed: 3 errors occurred:

* Failed to execute "terraform plan -input=false" in ./test-account/eu-west-1/s3/.terragrunt-cache/FIgbXJVdUJAkmsa6YIf24Zbjalw/p0hmT_yU9GfVIbcsvydhmNhIJWg
  ╷
  │ Error: Variables not allowed
  │ 
  │   on <value for var.bucket_name> line 1:
  │   (source code not available)
  │ 
  │ Variables may not be used here.
  ╵
  ╷
  │ Error: No value for required variable
  │ 
  │   on variables.tf line 1:
  │    1: variable "bucket_name" {
  │ 
  │ The root module input variable "bucket_name" is not set, and has no default
  │ value. Use a -var or -var-file command line argument to provide a value for
  │ this variable.
  ╵
  
  exit status 1

* Failed to execute "terraform plan -input=false" in ./management-account/eu-west-1/s3/.terragrunt-cache/6O7bSTWfYv7WPnJvTEak2cevHGQ/p0hmT_yU9GfVIbcsvydhmNhIJWg
  ╷
  │ Error: Variables not allowed
  │ 
  │   on <value for var.bucket_name> line 1:
  │   (source code not available)
  │ 
  │ Variables may not be used here.
  ╵
  ╷
  │ Error: No value for required variable
  │ 
  │   on variables.tf line 1:
  │    1: variable "bucket_name" {
  │ 
  │ The root module input variable "bucket_name" is not set, and has no default
  │ value. Use a -var or -var-file command line argument to provide a value for
  │ this variable.
  ╵
  
  exit status 1

* Failed to execute "terraform plan -input=false" in ./playground-account/eu-west-1/s3/.terragrunt-cache/Ife-siSQSkZudNuf1ioRzK__ydI/p0hmT_yU9GfVIbcsvydhmNhIJWg
  ╷
  │ Error: Unsupported attribute
  │ 
  │   on outputs.tf line 4, in output "bucket_id":
  │    4:         for k, v in aws_s3_bucket.this : k => k.id
  │ 
  │ Can't access attributes on a primitive-typed value (string).
  ╵
  
  exit status 1
```

</details>
    
